Ran Plan for project: `platform` dir: `2.platform` workspace: `default`

<details><summary>Show Output</summary>

```diff
infra-flash-commit:545266e 


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.http.casdoor_oidc_discovery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "casdoor_oidc_discovery" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + request_headers      = {
          + "Accept" = "application/json"
        }
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://sso.zitian.party/.well-known/openid-configuration"
    }

  # restapi_object.app_dashboard_oidc[0] will be created
+ resource "restapi_object" "app_dashboard_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_kubero_oidc[0] will be created
+ resource "restapi_object" "app_kubero_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_portal_gate[0] will be created
+ resource "restapi_object" "app_portal_gate" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.app_vault_oidc[0] will be created
+ resource "restapi_object" "app_vault_oidc" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-application"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-application"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-application"
      + read_path       = "/api/get-application?id=admin"
      + update_path     = "/api/update-application"
    }

  # restapi_object.provider_github[0] will be created
+ resource "restapi_object" "provider_github" {
      + api_data        = (known after apply)
      + api_response    = (known after apply)
      + create_path     = "/api/add-provider"
      + create_response = (known after apply)
      + data            = (sensitive value)
      + destroy_path    = "/api/delete-provider"
      + id              = (known after apply)
      + id_attribute    = "name"
      + path            = "/api/add-provider"
      + read_path       = "/api/get-provider?id=admin"
      + update_path     = "/api/update-provider"
    }

  # vault_jwt_auth_backend.oidc[0] will be created
+ resource "vault_jwt_auth_backend" "oidc" {
      + accessor           = (known after apply)
      + description        = "OIDC backend for Casdoor"
      + disable_remount    = false
      + id                 = (known after apply)
      + local              = false
      + namespace_in_state = true
      + oidc_client_id     = "vault-oidc"
      + oidc_client_secret = (sensitive value)
      + oidc_discovery_url = "https://sso.zitian.party"
      + path               = "oidc"
      + tune               = [
          + {
              + allowed_response_headers     = []
              + audit_non_hmac_request_keys  = []
              + audit_non_hmac_response_keys = []
              + default_lease_ttl            = "1h"
              + listing_visibility           = ""
              + max_lease_ttl                = "8h"
              + passthrough_request_headers  = []
              + token_type                   = "default-service"
            },
        ]
      + type               = "oidc"
    }

  # vault_jwt_auth_backend_role.reader[0] will be created
+ resource "vault_jwt_auth_backend_role" "reader" {
      + allowed_redirect_uris        = [
          + "http://localhost:8250/oidc/callback",
          + "https://secrets.zitian.party/ui/vault/auth/oidc/oidc/callback",
        ]
      + backend                      = "oidc"
      + bound_audiences              = [
          + "vault-oidc",
        ]
      + bound_claims_type            = (known after apply)
      + clock_skew_leeway            = 0
      + disable_bound_claims_parsing = false
      + expiration_leeway            = 0
      + id                           = (known after apply)
      + not_before_leeway            = 0
      + oidc_scopes                  = [
          + "email",
          + "openid",
          + "profile",
        ]
      + role_name                    = "reader"
      + role_type                    = "oidc"
      + token_policies               = [
          + "reader",
        ]
      + token_ttl                    = 3600
      + token_type                   = "default"
      + user_claim                   = "sub"
      + user_claim_json_pointer      = false
      + verbose_oidc_logging         = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ sso_e2e_status                 = {
      ~ oidc_discovery = "disabled" -> (known after apply)
      ~ portal_auth    = "disabled" -> "200"
    }
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`
</details>
Plan: 7 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`